In [1]:
# Que1:WAP to handle missing values and Duplicate values.

In [2]:
import pandas as pd

In [3]:
# creating dataframe
df={'Name':['Anju','Aashvi','Dipali','Forum','Sweta',None,'Anju'],
   'Age':[38,None,21,23,56,34,38],
   'pocket_money':[1000,200,1000,400,None,550,1000]}

In [4]:
df=pd.DataFrame(df)

In [5]:
df.head()

     Name   Age  pocket_money
0    Anju  38.0        1000.0
1  Aashvi   NaN         200.0
2  Dipali  21.0        1000.0
3   Forum  23.0         400.0
4   Sweta  56.0           NaN

In [6]:
 # Remove rows with any missing value
df_clean=df.dropna()

In [7]:
df_clean

     Name   Age  pocket_money
0    Anju  38.0        1000.0
2  Dipali  21.0        1000.0
3   Forum  23.0         400.0
6    Anju  38.0        1000.0

In [8]:
# Forward fill missing values
df_fill = df.fillna(method='ffill')

In [9]:
df_fill

     Name   Age  pocket_money
0    Anju  38.0        1000.0
1  Aashvi  38.0         200.0
2  Dipali  21.0        1000.0
3   Forum  23.0         400.0
4   Sweta  56.0         400.0
5   Sweta  34.0         550.0
6    Anju  38.0        1000.0

In [10]:
# Handle duplicate values
df_dup = df_fill.drop_duplicates()

In [11]:
df_dup

     Name   Age  pocket_money
0    Anju  38.0        1000.0
1  Aashvi  38.0         200.0
2  Dipali  21.0        1000.0
3   Forum  23.0         400.0
4   Sweta  56.0         400.0
5   Sweta  34.0         550.0